Pandas **Group By** Functionality.
We have a file in which we want to find average temperature and windspeed in different cities

In [1]:
import pandas as pd
df = pd.read_csv('06_weather_by_cities.csv')
df

         day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
4   1/1/2017    mumbai           90          5   Sunny
5   1/2/2017    mumbai           85         12     Fog
6   1/3/2017    mumbai           87         15     Fog
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
9   1/2/2017     paris           50         13  Cloudy
10  1/3/2017     paris           54          8  Cloudy
11  1/4/2017     paris           42         10  Cloudy

To print the data for just one city, what we can do is!

In [2]:
df[df.city=='new york']

        day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny

In [3]:
df[df.city=='mumbai']

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

In [4]:
df[df.city=='paris']

         day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

In [5]:
df[df.city=='paris'].temperature.max()

np.int64(54)

In [6]:
df[df.city=='new york'].temperature.max()

np.int64(36)

see the thing is it is a very small dataset, what if our dataset contains 10000 rows and 300 cities we cannot be able to filter these cities one by one, so for that we use group by, in which we have to specify some specific column to be grouped.

In [8]:
g = df.groupby('city')
g

It has returned some object which is DataFrameGroupBy object. What does it do exactly, for this consider a for loop as an example:

In [12]:
for city,data in g:
    print('city: ', city)
    print('\n')
    print('data: ', data)

city:  mumbai


data:          day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain
city:  new york


data:          day      city  temperature  windspeed  event
0  1/1/2017  new york           32          6   Rain
1  1/2/2017  new york           36          7  Sunny
2  1/3/2017  new york           28         12   Snow
3  1/4/2017  new york           33          7  Sunny
city:  paris


data:           day   city  temperature  windspeed   event
8   1/1/2017  paris           45         20   Sunny
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
11  1/4/2017  paris           42         10  Cloudy

So we can see that in each iteration we are looking at one city, and the second part of the for loop is the data part the 2nd part in the tuple is the actual dataFrame, so it is creating 3 DF and these DF are per cities.

We can find now maximum temperature.

In [14]:
for city,data in g:
    print('city: ', city)
    print('max: ', data.temperature.max())

city:  mumbai
max:  92
city:  new york
max:  36
city:  paris
max:  54

In [15]:
for city,data in g:
    print('city: ', city)
    print('min: ', data.temperature.min())

city:  mumbai
min:  85
city:  new york
min:  28
city:  paris
min:  42

In [17]:
# on G object there is method called:
g.get_group('mumbai')
# it will give us our specific dataFrame obj.

        day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
7  1/4/2017  mumbai           92          5   Rain

It was all about the for loop example.

# now let's move to the group by functionality in which we can do it by just one line.

In [22]:
g = df.groupby('city')
g

In [23]:
g.max()

               day  temperature  windspeed  event
city
mumbai    1/4/2017           92         15  Sunny
new york  1/4/2017           36         12  Sunny
paris     1/4/2017           54         20  Sunny

In [24]:
g.min()

               day  temperature  windspeed   event
city
mumbai    1/1/2017           85          5     Fog
new york  1/1/2017           28          6    Rain
paris     1/1/2017           42          8  Cloudy

When ever on our group by obj we do min max mean etc it will use always this concept called **Split, Apply, Combine**.
What i mean is that it will take the dataFrame and then split it as per cities and then for apply it will find mean or average or min, max and then it will combine all cities resultant data.

In [25]:
# for quick statistics we can use describe.
g.describe()

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

In [27]:
# size of each dataframe
g.size()

city
mumbai      4
new york    4
paris       4
dtype: int64

# Grouping data using custom functions. Let's say you want to group your data using custom functions for which the requirment is to create three groups

  # 1. Days when temperature was between 80-90
  # 2. Days when it was between 50-60
  # 3. Days when it was anything else.

In [31]:
# we can define a custom fucntion for these groups as:
def grouper(df, idx, col):
    if 80 <= df[col].loc[idx] <=90:
        return '80-90'
    elif 50 <= df[col].loc[idx] <=60:
        return '50-60'
    else:
        return 'Others'

In [32]:
g = df.groupby(lambda idx: grouper(df,idx,'temperature'))
g

In [33]:
for key,d in g:
    print('key',key)
    print('data',d)

key 50-60
data          day   city  temperature  windspeed   event
9   1/2/2017  paris           50         13  Cloudy
10  1/3/2017  paris           54          8  Cloudy
key 80-90
data         day    city  temperature  windspeed  event
4  1/1/2017  mumbai           90          5  Sunny
5  1/2/2017  mumbai           85         12    Fog
6  1/3/2017  mumbai           87         15    Fog
key Others
data          day      city  temperature  windspeed   event
0   1/1/2017  new york           32          6    Rain
1   1/2/2017  new york           36          7   Sunny
2   1/3/2017  new york           28         12    Snow
3   1/4/2017  new york           33          7   Sunny
7   1/4/2017    mumbai           92          5    Rain
8   1/1/2017     paris           45         20   Sunny
11  1/4/2017     paris           42         10  Cloudy